recipes/tu-no-casserole.org
#+TITLE: Tu-No Casserole
#+DATE: 2020-10-11
#+SETUPFILE: ../recipe.setup

[[https://gamechangersmovie.com/recipes/tu-no-casserole/][Original link]]

* Ingredients
** Casserole:
- 1 1/2 cups dry/uncooked elbow macaroni or small-shell pasta
- 8 medium white or cremini mushrooms, sliced (about 3 cups)
- 1 medium yellow or white onion, chopped (about 2 cups)
- 2 cups cooked peas
- 2 cans cooked garbanzo beans, drained and rinsed

** Sauce:
- 2 1/2 cups unsweetened plant-based milk
- 2 ounces raw, unsalted cashews (about 1/2 cup)
- 2 teaspoons granulated onion
- 1/2 teaspoon granulated garlic
- 1/2 teaspoon ground white pepper
- 3 to 4 teaspoons kelp granules (for a seafood flavor - optional)

* Instructions
1. Place all of the sauce ingredients (milk, cashews, granulated onion
   and garlic, white pepper, and kelp granules if using) into a
   blender and set aside for at least 15 minutes (so the cashews can
   soften).
2. Cook the pasta according to the package instructions. Drain and
   rinse with cool water, return the pasta to the pot, and set it
   aside.
3. Preheat the oven to 375°F. Set aside a 13 x 9-inch baking dish.
4. Heat 1 tablespoon of water in a frying pan over medium-high heat.
   When the water starts to sputter, add the mushrooms and onions and
   cook while stirring for 3 to 5 minutes or until the onions have
   softened and are lightly browned, adding a little water as needed.
   Add the onions and mushrooms, along with the peas, to the pot of
   cooked pasta.
5. Place the garbanzo beans into a food processor, and pulse just
   until the beans are broken up but not mushy (or use a fork or
   handheld bean masher). Add them to the soup pot.
6. Blend the sauce ingredients until smooth, and stir into the pot.
   (The mixture may be soupy, but it will firm up during cooking.)
7. Spoon the mixture evenly into the baking dish, and bake uncovered
   for 35 to 40 minutes or until the top is lightly browned. Let stand
   at least 5 minutes before serving.
