recipes/tu-no-casserole.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tu-No Casserole</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Tu-No Casserole</h1>
<p>
<a href="https://gamechangersmovie.com/recipes/tu-no-casserole/">Original link</a>
</p>

<div id="outline-container-org2383097" class="outline-2">
<h2 id="org2383097">Ingredients</h2>
<div class="outline-text-2" id="text-org2383097">
</div>
<div id="outline-container-org4bec3ce" class="outline-3">
<h3 id="org4bec3ce">Casserole:</h3>
<div class="outline-text-3" id="text-org4bec3ce">
<ul class="org-ul">
<li>1 1/2 cups dry/uncooked elbow macaroni or small-shell pasta</li>
<li>8 medium white or cremini mushrooms, sliced (about 3 cups)</li>
<li>1 medium yellow or white onion, chopped (about 2 cups)</li>
<li>2 cups cooked peas</li>
<li>2 cans cooked garbanzo beans, drained and rinsed</li>
</ul>
</div>
</div>

<div id="outline-container-org44f25ac" class="outline-3">
<h3 id="org44f25ac">Sauce:</h3>
<div class="outline-text-3" id="text-org44f25ac">
<ul class="org-ul">
<li>2 1/2 cups unsweetened plant-based milk</li>
<li>60g raw unsalted cashews (about 1/2 cup)</li>
<li>2 teaspoons granulated onion</li>
<li>1/2 teaspoon granulated garlic</li>
<li>1/2 teaspoon ground white pepper</li>
<li>3 to 4 teaspoons kelp granules (for a seafood flavor - optional)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org61632e4" class="outline-2">
<h2 id="org61632e4">Method</h2>
<div class="outline-text-2" id="text-org61632e4">
<ol class="org-ol">
<li>Place all of the sauce ingredients (milk, cashews, granulated onion
and garlic, white pepper, and kelp granules if using) into a
blender and set aside for at least 15 minutes (so the cashews can
soften).</li>
<li>Cook the pasta according to the package instructions. Drain and
rinse with cool water, return the pasta to the pot, and set it
aside.</li>
<li>Preheat the oven to 190&deg;C. Set aside a 30 x 20 cm baking dish.</li>
<li>Heat 1 tablespoon of water in a frying pan over medium-high heat.
When the water starts to sputter, add the mushrooms and onions and
cook while stirring for 3 to 5 minutes or until the onions have
softened and are lightly browned, adding a little water as needed.
Add the onions and mushrooms, along with the peas, to the pot of
cooked pasta.</li>
<li>Place the garbanzo beans into a food processor, and pulse just
until the beans are broken up but not mushy (or use a fork or
handheld bean masher). Add them to the soup pot.</li>
<li>Blend the sauce ingredients until smooth, and stir into the pot.
(The mixture may be soupy, but it will firm up during cooking.)</li>
<li>Spoon the mixture evenly into the baking dish, and bake uncovered
for 35 to 40 minutes or until the top is lightly browned. Let stand
at least 5 minutes before serving.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
